TestEDT1/src/Documents/Заказ/Заказ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Заказ</name>
  <attributes>
    <name>КоличествоСтрок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоТоваров</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СредняяЦенаТовара</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

TestEDT1/src/Documents/Заказ/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	Элементы.Товары.ТекущиеДанные.Сумма = Элементы.Товары.ТекущиеДанные.Количество * Элементы.Товары.ТекущиеДанные.Цена;
	ПересчитатьИтоговыеЗначенияДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	Элементы.Товары.ТекущиеДанные.Сумма = Элементы.Товары.ТекущиеДанные.Количество * Элементы.Товары.ТекущиеДанные.Цена;
	ПересчитатьИтоговыеЗначенияДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	Если Элементы.Товары.ТекущиеДанные.Количество = 0 Тогда
		Возврат;
	КонецЕсли;	
	Элементы.Товары.ТекущиеДанные.Цена = Элементы.Товары.ТекущиеДанные.Сумма / Элементы.Товары.ТекущиеДанные.Количество;
	ПересчитатьИтоговыеЗначенияДокумента();
КонецПроцедуры

&НаСервере
Процедура КопироватьВБуферОбменаНаСервере()
	БуферОбмена.КопироватьВБуферОбмена(Объект.Товары);
КонецПроцедуры

&НаКлиенте
Процедура КопироватьВБуферОбмена(Команда)
	КопироватьВБуферОбменаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВставитьИзБуфераОбменаНаСервере()
	СтруктураИзХранилища = БуферОбмена.ВернутьИзБуфераОбмена();	
	ТаблицаИзБуфера = СтруктураИзХранилища.Данные;
	Если Не ТаблицаИзБуфера = Неопределено Тогда
		БуферОбмена.ДополнитьТаблицу(ТаблицаИзБуфера,Объект.Товары);
	Иначе
		Сообщить ("В буфере обмена ничего нет");
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьИзБуфераОбмена(Команда)
	ВставитьИзБуфераОбменаНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ПересчитатьИтоговыеЗначенияДокумента()
	
	КоличествоСтрок = Объект.Товары.Количество();
	КоличествоТоваров = Объект.Товары.Итог("Количество");
	ОбщаяСтоимость = Объект.Товары.Итог("Сумма");
	
	Объект.КоличествоСтрок = КоличествоСтрок; 
	Объект.КоличествоТоваров = КоличествоТоваров; 
	Объект.ОбщаяСтоимость = ОбщаяСтоимость; 
	СредняяЦенаТовара = 0;
	
	Если КоличествоТоваров <> 0 Тогда
		СредняяЦенаТовара = ОбщаяСтоимость/КоличествоТоваров; 
	КонецЕсли; 
	
	Объект.СредняяЦенаТовара = СредняяЦенаТовара; 
 
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ПересчитатьИтоговыеЗначенияДокумента();
	
КонецПроцедуры
